PERSONAL_DATA_AGREEMENT = """
Для продолжения просим вас ознакомиться с согласием на обработку персональных данных, это необходимая формальность. 
Вы даете согласие?
"""

HI_MESSAGE_USER = """
Здравствуй, коллега!
Приветствуем Вас на нашем проекте "Старший администратор". Тут Вы узнаете все про:
Роль и ответственность старшего администратора
Управление командой и процессами сервиса
Организацию процессов сервиса через cjm
Управление качеством
Решение сложных ситуаций
Личную эффективность старшего администратора
Финансовую и административную аналитику и отчетность

Перед началом обучения вам будет необходимо пройти вводный тест, чтобы получить доступ к материалам, но сначала мы хотели бы познакомиться поближе
"""

HI_MESSAGE_CURATOR = """
Здравствуйте,
Вас приветствует бот-помощник по продажам в высоком сегменте.
Вам дан доступ куратора. Для продолжения зарегистрируйтесь в системе
"""

HI_MESSAGE_ADMIN = """
Здравствуйте,
Вас приветствует бот-помощник по продажам в высоком сегменте.
Вам дан доступ администратора. Для продолжения зарегистрируйтесь в системе
"""

BEFORE_ENTRY_TEST_MESSAGE = """
Для доступа к обучению просим Вас пройти вводный тест.
При успешной сдаче теста Вам откроется доступ ко всем материалам.
Нужно набрать от 50% правильных ответов. Удачи!"""

LESSONS_COMPLETE_MESSAGE = """
Поздравляем! Вы успешно справились со всеми этапами.
И теперь, чтобы закрепить полученные знания мы просим вас пройти итоговое тестирование.
Успешная сдача начинается с 50% правильных ответов
"""

ON_DONE_MESSAGE = """
поздравляем Вас с окончанием программы "Старший администратор"!
Мы были очень рады пройти этот путь вместе с Вами и очень признательны, что Вы выбрали нас.
Желаем Вам успехов в работе, покоряйте новые вершины и будьте самым великолепным руководителем!
Скоро мы пришлем Вам сертификат об окончании мастер-класса. Присоединяйтесь в наш <a href="https://t.me/beautykafedrachannel">телеграм канал</a>, будем рады Вашим отметкам в соц.сетях.
"""
