DESCRIPTION_ET = (
    "Вводное тестирование\n\n"
    "Описание: Для доступа к обучению просим Вас пройти вводный тест. "
    "При успешной сдаче теста Вам откроется доступ ко всем материалам. "
    "Нужно набрать от 50% правильных ответов. Удачи!"
)

MCQS_ET = [
    (
        "Какую основную задачу решает старший администратор в команде?",
        [
            ("A", "Быть посредником между мастерами и Гостями"),
            ("B", "Контролировать дисциплину"),
            ("C", "Обеспечивать стабильность сервиса и выполнение стандартов"),
            ("D", "Закрывать продажи"),
        ],
        "C",
    ),
    (
        "Какая функция менеджмента отвечает за распределение ресурсов и зон ответственности?",
        [
            ("A", "Контроль"),
            ("B", "Мотивация"),
            ("C", "Организация"),
            ("D", "Аналитика"),
        ],
        "C",
    ),
    (
        "Что является ключевым в мотивации персонала?",
        [
            ("A", "Только деньги"),
            ("B", "Только похвала"),
            ("C", "Баланс материальной и нематериальной мотивации"),
            ("D", "Увеличение нагрузки"),
        ],
        "C",
    ),
    (
        "Что является «первой дырой» слива продаж?",
        [
            ("A", "Касание с администратором"),
            ("B", "Консультация мастера"),
            ("C", "Получение услуги"),
            ("D", "Повторная запись"),
        ],
        "A",
    ),
    (
        "Что должно происходить после оказания услуги Гостю?",
        [
            ("A", "Быстрое завершение визита"),
            ("B", "Обратная связь, предложение домашнего ухода и предзапись"),
            ("C", "Сбор отзывов онлайн"),
            ("D", "Передача кассового чека"),
        ],
        "B",
    ),
    (
        "Что повышает вероятность возврата Гостя?",
        [
            ("A", "Скидка на следующий визит"),
            ("B", "Сообщение через неделю"),
            ("C", "Эмоциональная привязанность при прощании и предзапись"),
            ("D", "Напоминание от CRM"),
        ],
        "C",
    ),
    (
        "Что является основой управленческой эффективности старшего администратора?",
        [
            ("A", "Личная харизма"),
            ("B", "Стабильность ключевых показателей (конверсии, возвратность, средний чек)"),
            ("C", "Личные продажи"),
            ("D", "Количество отчетов"),
        ],
        "B",
    ),
    (
        "Как часто рекомендуется проводить проверку «Тайным Гостем»?",
        [
            ("A", "Раз в неделю"),
            ("B", "Раз в квартал"),
            ("C", "Раз в месяц"),
            ("D", "Раз в год"),
        ],
        "C",
    ),
    (
        "Что входит в этапы внедрения нового сотрудника?",
        [
            ("A", "Только инструктаж"),
            ("B", "Подпись договора"),
            ("C", "Подготовка, знакомство, визуализация, сопровождение и корректировка"),
            ("D", "Проведение собеседования"),
        ],
        "C",
    ),
    (
        "Какая цель аттестации сотрудников?",
        [
            ("A", "Повышение зарплаты"),
            ("B", "Проведение теста"),
            ("C", "Оценка знаний, навыков и потенциала для развития"),
            ("D", "Контроль графика"),
        ],
        "C",
    ),
]


DESCRIPTION_FT = (
    "Финальное тестирование\n\n"
    "Для доступа к завершению курса пройдите финальный тест. "
    "Порог прохождения — от 50% правильных ответов."
)

MCQS_FT =[
    (
        "Какую основную задачу решает старший администратор в команде?",
        [
            ("A", "Быть посредником между мастерами и Гостями"),
            ("B", "Контролировать дисциплину"),
            ("C", "Обеспечивать стабильность сервиса и выполнение стандартов"),
            ("D", "Закрывать продажи"),
        ],
        "C",
    ),
    (
        "Какая функция менеджмента отвечает за распределение ресурсов и зон ответственности?",
        [
            ("A", "Контроль"),
            ("B", "Мотивация"),
            ("C", "Организация"),
            ("D", "Аналитика"),
        ],
        "C",
    ),
    (
        "Что является ключевым в мотивации персонала?",
        [
            ("A", "Только деньги"),
            ("B", "Только похвала"),
            ("C", "Баланс материальной и нематериальной мотивации"),
            ("D", "Увеличение нагрузки"),
        ],
        "C",
    ),
    (
        "Что является «первой дырой» слива продаж?",
        [
            ("A", "Касание с администратором"),
            ("B", "Консультация мастера"),
            ("C", "Получение услуги"),
            ("D", "Повторная запись"),
        ],
        "A",
    ),
    (
        "Что должно происходить после оказания услуги Гостю?",
        [
            ("A", "Быстрое завершение визита"),
            ("B", "Обратная связь, предложение домашнего ухода и предзапись"),
            ("C", "Сбор отзывов онлайн"),
            ("D", "Передача кассового чека"),
        ],
        "B",
    ),
    (
        "Что повышает вероятность возврата Гостя?",
        [
            ("A", "Скидка на следующий визит"),
            ("B", "Сообщение через неделю"),
            ("C", "Эмоциональная привязанность при прощании и предзапись"),
            ("D", "Напоминание от CRM"),
        ],
        "C",
    ),
    (
        "Что является основой управленческой эффективности старшего администратора?",
        [
            ("A", "Личная харизма"),
            ("B", "Стабильность ключевых показателей (конверсии, возвратность, средний чек)"),
            ("C", "Личные продажи"),
            ("D", "Количество отчетов"),
        ],
        "B",
    ),
    (
        "Как часто рекомендуется проводить проверку «Тайным Гостем»?",
        [
            ("A", "Раз в неделю"),
            ("B", "Раз в квартал"),
            ("C", "Раз в месяц"),
            ("D", "Раз в год"),
        ],
        "C",
    ),
    (
        "Что входит в этапы внедрения нового сотрудника?",
        [
            ("A", "Только инструктаж"),
            ("B", "Подпись договора"),
            ("C", "Подготовка, знакомство, визуализация, сопровождение и корректировка"),
            ("D", "Проведение собеседования"),
        ],
        "C",
    ),
    (
        "Какая цель аттестации сотрудников?",
        [
            ("A", "Повышение зарплаты"),
            ("B", "Проведение теста"),
            ("C", "Оценка знаний, навыков и потенциала для развития"),
            ("D", "Контроль графика"),
        ],
        "C",
    ),
]

LETTER_ORDER = {"A": 1, "B": 2, "C": 3, "D": 4}

ENTRY_TEST_FAIL_MESSAGE = """
К сожалению, Вы не прошли вводный тест.
Подготовьтесь еще раз, проанализируйте свои ошибки, и пройдите тестирование еще раз. Все получится!
"""

ENTRY_TEST_COMPLETION_MESSAGE = """
Время начинать обучение. 
Как все будет проходить?
Вам будут отправляться видеоуроки по каждому блоку. 
после просмотра Вам необходимо проставить галочку под видео, чтобы получить доступ к следующему. 
Обратите внимание, у Вас будет несколько домашних заданий, которые необходимо выполнить, в одном из них - доступ к следующим урокам будет доступен только после получения Вашего ответа и его проверки. 
Напомним, что обучение включает в себя 7 блоков. При ежедневном внимании к курсу Вы  освоите его за неделю.
Желаем удачи!
"""

FINAL_TEST_FAIL_MESSAGE = """
К сожалению, Вы не прошли итоговое тестирование.
Подготовьтесь еще раз, проанализируйте свои ошибки, вспомните пройденный материал и пройдите тестирование еще раз. Все получится!
"""

FINAL_TEST_NORMAL_COMPLETION_MESSAGE = """
Поздравляем! Вы успешно справились с итоговым тестированием.
Позже Ваш куратор пришлет Вам и Вашему руководителю обратную связь по итогам Вашего обучения.
"""

FINAL_TEST_PERFECT_COMPLETION_MESSAGE = """
Поздравляем! Вы великолепно справились с итоговым тестированием. 
Позже Ваш куратор пришлет Вам и Вашему руководителю обратную связь по итогам Вашего обучения.
"""


